{
  "career": [
    {
      "name": "FAANG",
      "href": "",
      "title": "Incomming Software Engineer Intern",
      "logo": "/stealth.jpg",
      "start": "Jun 2025",
      "end": "Sep 2025",
      "description": [
        "infra + full stack :)"
      ] 
    },
    {
      "name": "UCSD Video Processing Lab - Dr. Nguyen (ECE Dept.)",
      "href": "https://ece.ucsd.edu/",
      "title": "Software Engineer + CV Research Assistant",
      "logo": "/ucsd-ece.png",
      "start": "Feb 2025",
      "description": [
        "Leveraged YOLOv11 to classify student actions with 80% accuracy to evaluate attentiveness score during lectures",
        "Accelerated real-time classification by 99% by leveraging Socket.IO to process continuous data from video feeds ",
        "Researching applications of computer vision to provide data for professors to evaluate and improve their lectures"
      ] 
    },
    {
      "name": "UCSD XR Lab - Dr. Kirsh (CSE Dept.)",
      "href": "https://cse.ucsd.edu/",
      "title": "Software Engineer + AI Research Assistant",
      "logo": "/ucsd-cse.png",
      "start": "Jan 2025",
      "description": [
        "Migrating data pipeline from CSV stored in PostgreSQL database to HDF5 structure to increase speed of SER project",
        "Accelerated data processing efficiency by 60% by automating audio-to-text transcription workflows using Wispr API",  
        "Building lab’s custom AI agents to reduce repetitive data annotation tasks by 30% for 3 ongoing lab projects",
        "Researching non-Euclidean spaces’ effect on neural basis of spatial cognition and episodic memory in humans"
      ] 
    },
    {
      "name": "UCSD LIL Lab - Dr. Zettersten (Cog Sci Dept.)",
      "href": "https://cogsci.ucsd.edu/",
      "title": "Software Engineer + Research Assistant",
      "logo": "/ucsd-cog-sci.png",
      "start": "Dec 2024",
      "description": [
        "Implementing a React and JsPsych web applications to gather data and run experiments for on various lab projects",
        "Analyzing 3,000+ empirical data points identifying significant patterns in language learning and visualized data using R", 
        "Revising sections of our research paper for the 2025-26 ACL Conference and consistently contributing to 20+ datasets"
      ]
    },
    {
      "name": "Dream Voyage",
      "href": "https://apps.apple.com/tr/app/sine-daily-manifest/id6472605644",
      "title": "Software Engineering Intern (Full Stack)",
      "logo": "/DV.jpg",
      "start": "Jan 2024",
      "end": "Sep 2024",
      "description": [
        "Increased user traffic to 35,000+ monthly users by implementing a responsive user interface using React and TypeScript", 
        "Implemented cloud solutions such as AWS Lambda and RDS to scale application infrastructure that maintained web application system’s uptime at 90% during production and utilized Docker containers for version testing",
        "Developed the Community Post & Dream Interpretation features on the mobile application- deployed on the App Store"
      ]
    }
  ]
}
